# Вариант 5.
# Книжные магазины предлагают следующие коллекции книг.
# Магистр – Лермонтов, Достоевский, Пушкин, Тютчев
# ДомКниги – Толстой, Грибоедов, Чехов, Пушкин.
# БукМаркет – Пушкин, Достоевский, Маяковский.
# Галерея – Чехов, Тютчев, Пушкин.
# Определить в каких магазинах можно приобрести книги Пушкина и Тютчева

magistr = {'Лермонтов', 'Достоевский', 'Пушкин', 'Тютчев'}
domknigi = {'Толстой', 'Грибоедов', 'Чехов', 'Пушкин'}
bukmarket = {'Пушкин', 'Достоевский', 'Маяковский'}
galeria = {'Чехов', 'Тютчев', 'Пушкин'}

pушкиn_shops = {shop for shop, authors in {
    'Магистр': magistr,
    'ДомКниги': domknigi,
    'БукМаркет': bukmarket,
    'Галерея': galeria
}.items() if 'Пушкин' in authors}

tyutchev_shops = {shop for shop, authors in {
    'Магистр': magistr,
    'ДомКниги': domknigi,
    'БукМаркет': bukmarket,
    'Галерея': galeria
}.items() if 'Тютчев' in authors}

print('книги Пушкина можно приобрести в магазинах:', pушкиn_shops)
print('книги Тютчева можно приобрести в магазинах:', tyutchev_shops)
