"""Вариант 5. Мастям игральных карт присвоены порядковые номера: 1 - пики, 2 - трефы, 3 - бубны, 4 - червы.
Достоинству карт присвоены номера: 11 - валет, 12 - дама, 13 - король, 14 - туз. Дано трёхзначное число, в котором первая цифра
указывает на масть, а вторые две на достоинство карты. Вывести соответствующее название карты вида "дама червей", "туз треф" и т.п."""

try:
    num = int(input("введите трёхзначное число: "))
    suit = num // 100
    rank = num % 100

    suits = {1: "пик", 2: "треф", 3: "бубен", 4: "червей"}
    ranks = {11: "валет", 12: "дама", 13: "король", 14: "туз"}

    if suit in suits and rank in ranks:
        print(f"{ranks[rank]} {suits[suit]}")
    else:
        print("неверный номер карты")
except ValueError:
    print("ошибка, как так то")
