# Вариант 5
# Дан словарь с произвольным количеством элементов.
# Выяснить, имеется ли в нём элемент с ключом «фрукт»,
# и если он отсутствует, то добавить его в словарь со значением «яблоко».
# Вывести на экран первоначальный словарь и изменённый.

original_dict = {'цвет': 'красный', 'число': 42}

print("первоначальный словарь:", original_dict)

if 'фрукт' not in original_dict:
    original_dict['фрукт'] = 'яблоко'

print("изменённый словарь:", original_dict)
