# Вариант 5
# Задание 1: Выведите возраст из data = {'person': {'name': 'Alice', 'age': 30}}.

data = {'person': {'name': 'Alice', 'age': 30}}
print(data['person']['age'])
