# ввод, чтобы потом подставить в формулы
V1 = float(input("Введите скорость первого автомобиля (км/ч): "))
V2 = float(input("Введите скорость второго автомобиля (км/ч): "))
S = float(input("Введите начальное расстояние между автомобилями (км): "))
T = float(input("Введите время движения (часы): "))


total_speed = V1 + V2


total_distance_traveled = total_speed * T

# расстояние считаем, используем abs для получения модуля, если автомобили не встретятся то будет отрицательное расстояние
distance_after_T = abs(S - total_distance_traveled)

# итог
print(f"Расстояние между автомобилями через {T} часов: {distance_after_T:.2f} км")
